{
    "ru": {
        "message": {
            "bio_text": "Фронтенд-разработчик, создающий чистые\n и продуманные интерфейсы. Специализируюсь\n на разработке веб-решений, уделяя внимание деталям дизайна, качеству кода и современным подходам\n в веб-технологиях.",

            "approach_home_section_title": "Мой подход к разработке",

            "clean_code_title": "Чистый код",
            "clean_code_subtitle": "Пишу понятный, структурированный и поддерживаемый код, следуя лучшим практикам.",

            "ux_ui_attention_title": "UX/UI внимание",
            "ux_ui_attention_subtitle": "Проектирую интерфейсы с фокусом на удобство, логику и пользовательский опыт.",

            "learning_title": "Рост через обучение",
            "learning_subtitle": "Постоянно изучаю новые подходы и инструменты для профессионального роста.",

            "tech_stack_home_section_title": "Технический стек",
            "tech_stack_card_title_1": "Экосистема Vue ",
            "tech_stack_card_subtitle_1": "Опыт работы с Vue, а также с ключевыми инструментами экосистемы: Vuex, Vue Router, Vuetify, Vue i18n, VueUse, Nuxt и Pinia. Использую их для создания современных SPA и универсальных приложений.",
            "tech_stack_card_title_2": "JS/TS Среда",
            "tech_stack_card_subtitle_2": "Современные решения на JavaScript и TypeScript, а также более 40 библиотек и инструментов, которые я активно применял на практике для разработки и реализации различных задач.",

            "projects_home_section_title": "Проекты"
        }
    },
    "en": {
        "message": {
            "bio_text": "Frontend developer crafting clean and thoughtful interfaces.\nI specialize in building web solutions with a focus on design details, code quality, and modern web technologies.",

            "approach_home_section_title": "My Approach to Development",

            "clean_code_title": "Clean Code",
            "clean_code_subtitle": "Write clear, well-structured, and maintainable code, following best practices.",

            "ux_ui_attention_title": "UX/UI Focus",
            "ux_ui_attention_subtitle": "Design interfaces with a strong focus on usability, logic, and user experience.",

            "learning_title": "Learning-Driven Growth",
            "learning_subtitle": "Continuously learn new approaches and tools to support professional growth.",

            "tech_stack_home_section_title": "Tech Stack",
            "tech_stack_card_title_1": "Vue Ecosystem",
            "tech_stack_card_subtitle_1": "Experience working with Vue, as well as key ecosystem tools: Vuex, Vue Router, Vuetify, Vue i18n, VueUse, Nuxt and Pinia. I use them to create modern SPAs and universal applications.",
            "tech_stack_card_title_2": "JS/TS Environment",
            "tech_stack_card_subtitle_2": "Modern solutions in JavaScript and TypeScript, as well as over 40 libraries and tools that I have actively used in practice for developing and implementing various tasks.",

            "projects_home_section_title": "Projects"
        }
    }
}
