{
    "ru": [
        {
            "id": 0,
            "version": "v0.0.1 бета",
            "date": "28 Июля 2025",
            "descriptions": ["Здравствуй, мир!"]
        },
        {
            "id": 1,
            "version": "v0.3.30 бета",
            "date": "13 августа 2025",
            "descriptions": [
                "Добавлена интерактивная карта на страницу «Обо мне» - теперь можно увидеть мое местоположение и даже отдалить карту настолько, чтобы посмотреть на нашу планету из космоса.",
                "Оптимизация и исправления - улучшена производительность сайта и устранены мелкие баги для более плавной и стабильной работы."
            ]
        },
        {
            "id": 2,
            "version": "v0.4.40 бета",
            "date": "17 августа 2025",
            "descriptions": [
                "Добавлена карточка метаданных проекта на страницу «Обо мне» в стиле редактора кода, отображающая статистику проекта: количество строк кода, файлов, папок и общий размер проекта.",
                "Оптимизация и исправления - улучшена производительность сайта и устранены мелкие баги для более плавной и стабильной работы."
            ]
        },
        {
            "id": 3,
            "version": "v0.5.83 бета",
            "date": "29 августа 2025",
            "descriptions": [
                "Фотографии в галерее стали интерактивными - теперь можно нажать на любую фотографию и увидеть краткую информацию на её обратной стороне.",
                "Добавлена интерактивная карточка «Образование» на страницу «Обо мне» - при нажатии открывается модальное окно с подробной информацией об учебных заведениях в которых я учился."
            ]
        },
        {
            "id": 4,
            "version": "v0.5.153 бета",
            "date": "10 сентября 2025",
            "descriptions": [
                "Добавлены две новые секции на главную страницу: «Мой подход к разработке» и «Технический стек» - теперь можно лучше понять мою философию работы и используемые технологии.",
                "Оптимизация и исправления - улучшена производительность сайта и устранены мелкие баги для более плавной и стабильной работы."
            ]
        },
        {
            "id": 5,
            "version": "v0.6.42 бета",
            "date": "16 сентября 2025",
            "descriptions": [
                "Добавлена карточка с музыкальным плеером на страницу «Обо мне» - теперь можно послушать одни из моих любымих песен.",
                "Оптимизация и исправления - улучшена производительность сайта и устранены мелкие баги для более плавной и стабильной работы."
            ]
        },
        {
            "id": 6,
            "version": "v0.7.92 бета",
            "date": "22 сентября 2025",
            "descriptions": [
                "Переработан дизайн карточек на странице «Обо мне» для улучшения визуальной гармонии и удобства восприятия.",
                "Добавлена интерактивная карточка с UI-китом сайта, включая имитацию поведения курсора из Figma.",
                "Появилась новая карточка с иконками, которые можно перетаскивать мышкой - просто для fun'а и интерактива."
            ]
        },
        {
            "id": 7,
            "version": "v0.8.42 бета",
            "date": "24 сентября 2025",
            "descriptions": [
                "Внесены небольшие улучшения в удобство использования и внешний вид сайта - изменения незаметные, но делают навигацию приятнее.",
                "Улучшена производительность сайта - страницы теперь работают быстрее и отзывчивее."
            ]
        },
        {
            "id": 8,
            "version": "v0.9.59 бета",
            "date": "28 сентября 2025",
            "descriptions": [
                "Небольшое обновление страницы «О проекте» для того что бы больше соответствовать «Study Case»: добавлены секции «Зоны ответственности» и «Контекст и цель». Это делает страницу более информативной и помогает лучше понять проект и мою роль в нём."
            ]
        },
        {
            "id": 9,
            "version": "v1.0.0",
            "date": "7 октября 2025",
            "descriptions": [
                "Первый официальный релиз 🎉 Проведена большая работа по оптимизации и устранению мелких ошибок - сайт стал быстрее и стабильнее.",
                "Теперь сайт адаптирован под планшеты и мобильные устройства. Адаптация ещё в процессе, но уже можно удобно просматривать контент с разных экранов.",
                "Карточка «Образование» временно скрыта - готовлю обновлённую версию с улучшенным дизайном.",
                "На страницу проектов добавлен новый проект - «Генератор паролей».",
                "В музыкальном плеере появились новые песни."
            ]
        },
        {
            "id": 10,
            "version": "v1.1.36",
            "date": "17 декабря 2025",
            "descriptions": [
                "Интерфейс сайта получил визуальные доработки по всему проекту, направленные на повышение целостности, аккуратности и визуальной согласованности.",
                "Переработан дизайн карточек в секциях «Мой подход к разработке» и «Технический стэк» - улучшена читаемость, структура и визуальная иерархия контента.",
                "Проведена оптимизация кода: повышена общая стабильность приложения, кодовая база стала более надёжной и удобной для дальнейшего развития."
            ]
        }
    ],
    "en": [
        {
            "id": 0,
            "version": "v0.0.1 beta",
            "date": "July 28, 2025",
            "descriptions": ["Hello, world!"]
        },
        {
            "id": 1,
            "version": "v0.3.30 beta",
            "date": "August 13, 2025",
            "descriptions": [
                "An interactive map was added to the 'About Me' page – now you can see my location and even zoom out far enough to view our planet from space.",
                "Optimization & fixes – improved site performance and resolved minor bugs for smoother and more stable operation."
            ]
        },
        {
            "id": 2,
            "version": "v0.4.40 beta",
            "date": "August 17, 2025",
            "descriptions": [
                "Added a project metadata card to the 'About Me' page styled like a code editor, showing project statistics: number of lines of code, files, folders, and total project size.",
                "Optimization & fixes – improved site performance and resolved minor bugs for smoother and more stable operation."
            ]
        },
        {
            "id": 3,
            "version": "v0.5.83 beta",
            "date": "August 29, 2025",
            "descriptions": [
                "Photos in the gallery are now interactive – click on any photo to see short information on its back side.",
                "Added an interactive 'Education' card to the 'About Me' page – clicking it opens a modal with detailed information about the schools I studied at."
            ]
        },
        {
            "id": 4,
            "version": "v0.5.153 beta",
            "date": "September 10, 2025",
            "descriptions": [
                "Two new sections were added to the homepage: 'My Approach to Development' and 'Tech Stack' – giving better insight into my work philosophy and the technologies I use.",
                "Optimization & fixes – improved site performance and resolved minor bugs for smoother and more stable operation."
            ]
        },
        {
            "id": 5,
            "version": "v0.6.42 beta",
            "date": "September 16, 2025",
            "descriptions": [
                "Added a card with a music player to the 'About Me' page – now you can listen to some of my favorite songs.",
                "Optimization & fixes – improved site performance and resolved minor bugs for smoother and more stable operation."
            ]
        },
        {
            "id": 6,
            "version": "v0.7.92 beta",
            "date": "September 22, 2025",
            "descriptions": [
                "Redesigned the cards on the 'About Me' page for better visual harmony and readability.",
                "Added an interactive card with the website’s UI kit, including cursor behavior imitation from Figma.",
                "Introduced a new card with draggable icons – just for fun and interactivity."
            ]
        },
        {
            "id": 7,
            "version": "v0.8.42 beta",
            "date": "September 24, 2025",
            "descriptions": [
                "Made small improvements to the usability and appearance of the site - changes are subtle but make navigation smoother.",
                "Improved site performance - pages now load faster and feel more responsive."
            ]
        },
        {
            "id": 8,
            "version": "v0.9.59 beta",
            "date": "September 28, 2025",
            "descriptions": [
                "A minor update to the 'About the Project' page to better align it with the 'Study Case' format: added sections 'Areas of Responsibility' and 'Context and Goal'. This makes the page more informative and helps to better understand the project and my role in it."
            ]
        },
        {
            "id": 9,
            "version": "v1.0.0",
            "date": "October 7, 2025",
            "descriptions": [
                "First official release 🎉 A lot of work has been done on optimization and fixing minor bugs - the site is now faster and more stable.",
                "The site is now adapted for tablets and mobile devices. Adaptation is still in progress, but it’s already convenient to browse content on different screens.",
                "The “Education” card has been temporarily hidden - I’m preparing an updated version with improved design.",
                "A new project has been added to the projects page - “Password Generator.”",
                "New songs have been added to the music player."
            ]
        },
        {
            "id": 10,
            "version": "v1.1.36",
            "date": "December 17, 2025",
            "descriptions": [
                "The website interface received visual refinements across the entire project, aimed at improving visual consistency, coherence, and overall polish.",
                "Redesigned the cards in the “My Development Approach” and “Tech Stack” sections - improved readability, structure, and visual hierarchy of the content.",
                "Performed code optimization - improved overall application stability, making the codebase more reliable and easier to maintain."
            ]
        }
    ]
}
