{
    "ru": [
        {
            "id": 0,
            "version": "v0.0.1",
            "date": "28 Июля 2025",
            "type": "beta",
            "summary": "Привет, мир!"
        },
        {
            "id": 1,
            "version": "v0.3.30",
            "date": "13 августа 2025",
            "type": "beta",
            "summary": "Обновление, направленное на расширение возможностей страницы «Обо мне» и общее повышение качества работы сайта. Релиз делает взаимодействие с контентом нагляднее и стабильнее.",
            "changes": [
                "Добавлена интерактивная карта на страницу «Обо мне» - теперь можно увидеть мое местоположение и даже отдалить карту настолько, чтобы посмотреть на нашу планету из космоса.",
                "Оптимизация и исправления - улучшена производительность сайта и устранены мелкие баги для более плавной и стабильной работы."
            ]
        },
        {
            "id": 2,
            "version": "v0.4.40",
            "date": "17 августа 2025",
            "type": "beta",
            "summary": "Обновление, направленное на улучшение представления проекта и повышение общего качества работы сайта. Релиз делает информацию о проекте более наглядной, а интерфейс - стабильнее",
            "changes": [
                "Добавлена карточка метаданных в виде редактора кода проекта на страницу «Обо мне», наглядно отображающая ключевые показатели и структуру проекта.",
                "Оптимизирована производительность сайта и исправлены мелкие ошибки, что повысило стабильность и плавность взаимодействия с интерфейсом."
            ]
        },
        {
            "id": 3,
            "version": "v0.5.83",
            "date": "29 августа 2025",
            "type": "beta",
            "summary": "Обновление, сфокусированное на улучшении взаимодействия с галереей. Релиз закладывает основу для более интерактивного и информативного просмотра контента.",
            "changes": [
                "Добавлены интерактивные фотографии на странице «Галереи», позволяющие при нажатии просматривать краткую информацию на обратной стороне изображения."
            ]
        },
        {
            "id": 4,
            "version": "v0.5.153",
            "date": "10 сентября 2025",
            "type": "minor",
            "summary": "Обновление, направленное на более полное раскрытие профессионального профиля и повышение общего качества работы сайта. Релиз делает главную страницу информативнее и понятнее для просмотра.",
            "changes": [
                "Добавлены новые секции «Мой подход к разработке» и «Технический стек» на главную страницу, позволяющие лучше понять принципы работы и профессиональный фокус.",
                "Оптимизирована производительность сайта и исправлены мелкие ошибки, что повысило стабильность и плавность взаимодействия с интерфейсом."
            ]
        },
        {
            "id": 5,
            "version": "v0.6.42",
            "date": "16 сентября 2025",
            "type": "minor",
            "summary": "Обновление, направленное на персонализацию страницы «Обо мне» и повышение общего качества работы сайта. Релиз делает контент более живым и улучшает стабильность интерфейса.",
            "changes": [
                "Добавлена карточка с музыкальным плеером на страницу «Обо мне», позволяющая прослушивать подборку любимых треков.",
                "Оптимизирована производительность сайта и исправлены мелкие ошибки, что повысило стабильность и плавность взаимодействия с интерфейсом."
            ]
        },
        {
            "id": 6,
            "version": "v0.7.92",
            "date": "22 сентября 2025",
            "type": "beta",
            "summary": "Обновление, сфокусированное на визуальной переработке и экспериментальных элементах взаимодействия. Релиз исследует новые подходы к подаче контента и интерактивности страницы «Обо мне».",
            "changes": [
                "Переработан дизайн карточек на странице «Обо мне», что улучшило визуальную целостность и удобство восприятия контента.",
                "Добавлена интерактивная карточка с UI-китом сайта, позволяющая наглядно изучить элементы интерфейса и их поведение.",
                "Добавлена интерактивная карточка с перетаскиваемыми иконками, усиливающая ощущение живого взаимодействия с интерфейсом."
            ]
        },
        {
            "id": 7,
            "version": "v0.8.42",
            "date": "24 сентября 2025",
            "type": "improvement",
            "summary": "Обновление, направленное на повышение удобства использования и общей отзывчивости сайта. Релиз делает взаимодействие с интерфейсом более комфортным и стабильным.",
            "changes": [
                "Улучшены удобство использования и внешний вид сайта, что сделало навигацию более понятной и аккуратной.",
                "Оптимизирована производительность страниц, повысив скорость работы и отзывчивость интерфейса."
            ]
        },
        {
            "id": 8,
            "version": "v0.9.59",
            "date": "28 сентября 2025",
            "type": "minor",
            "summary": "Обновление, направленное на уточнение и структурирование информации о проектах. Релиз делает страницу «О проекте» более понятной и ориентированной на демонстрацию контекста работы.",
            "changes": [
                "Добавлены секции «Зоны ответственности» и «Контекст и цель» на страницу «О проекте», что повысило информативность и помогает лучше понять проект и роль в нём."
            ]
        },
        {
            "id": 9,
            "version": "v1.0.0",
            "date": "7 октября 2025",
            "type": "major",
            "summary": "Первый официальный релиз 🎉, фиксирующий первую стабильную версию проекта и закладывающий основу для дальнейшего развития. Обновление повышает надёжность сайта и расширяет доступность контента на разных устройствах.",
            "changes": [
                "Проведена комплексная оптимизация и исправлены мелкие ошибки, что повысило скорость и стабильность работы сайта.",
                "Добавлена адаптация интерфейса под планшеты и мобильные устройства, улучшив удобство просмотра контента на разных экранах.",
                "Добавлен новый проект «Генератор паролей» на страницу проектов, расширяющий портфолио.",
                "Обновлено содержимое музыкального плеера, дополнив его новыми треками."
            ]
        },
        {
            "id": 10,
            "version": "v1.1.36",
            "date": "17 декабря 2025",
            "type": "improvement",
            "summary": "Минорное обновление, направленное на повышение визуальной целостности интерфейса и улучшение качества основы проекта. Релиз делает сайт аккуратнее, понятнее и стабильнее в повседневном использовании.",
            "changes": [
                "Обновлён интерфейс сайта по всему проекту, что повысило визуальную согласованность и общее ощущение аккуратности.",
                "Переработан дизайн карточек в секциях «Мой подход к разработке» и «Технический стек», улучшив читаемость, структуру и визуальную иерархию контента.",
                "Оптимизирована внутренняя логика приложения, что повысило стабильность и упростило дальнейшее развитие проекта."
            ]
        },
        {
            "id": 11,
            "version": "v1.2.61",
            "date": "8 января 2026",
            "type": "major",
            "summary": "Обновление, сфокусированное на качестве восприятия и устойчивости работы сайта. Релиз повышает предсказуемость интерфейса и делает презентацию проектов более выразительной и понятной.",
            "changes": [
                "Оптимизирована внутренняя логика сайта, что повысило производительность, стабильность и предсказуемость работы интерфейса в разных сценариях использования.",
                "Обновлены и переработаны тексты по всему сайту, сделав формулировки более точными, структурированными и отражающими суть проектов и подход к разработке.",
                "Добавлены видеообложки в карточки проектов, усиливающие наглядность и помогающие быстрее понять идею и функциональность каждого проекта."
            ]
        },
        {
            "id": 12,
            "version": "v1.3.84",
            "date": "15 февраля 2026",
            "type": "improvement",
            "summary": "Обновление, направленное на фундаментальное улучшение качества кода, производительности и визуального восприятия проекта. Релиз делает сайт легче, стабильнее и системнее как с точки зрения интерфейса, так и внутренней структуры.",
            "changes": [
                "Переработана архитектурная основа проекта, что повысило предсказуемость поведения интерфейса и упростило дальнейшее развитие.",
                "Оптимизирована внутренняя логика и уменьшен объём кода, что снизило нагрузку на браузер и ускорило работу сайта.",
                "Оптимизировано управление состоянием приложения, улучшив производительность и стабильность в повседневных сценариях использования.",
                "Обновлена визуальная концепция интерфейса, сделав дизайн более лёгким, минималистичным и современным.",
                "Переработан журнал изменений, улучшив структуру, читаемость и навигацию по типам обновлений.",
                "Исправлены мелкие визуальные и функциональные ошибки, повысив общее качество и аккуратность интерфейса."
            ]
        }
    ],
    "en": [
        {
            "id": 0,
            "version": "v0.0.1",
            "date": "July 28, 2025",
            "type": "beta",
            "summary": "Hello, world!"
        },
        {
            "id": 1,
            "version": "v0.3.30",
            "date": "August 13, 2025",
            "type": "beta",
            "summary": "An update focused on expanding the capabilities of the “About Me” page and improving the overall quality of the website. The release makes interaction with content clearer and more stable.",
            "changes": [
                "An interactive map has been added to the “About Me” page — you can now see my location and even zoom out far enough to view our planet from space.",
                "Optimizations and fixes — website performance has been improved and minor bugs have been fixed for smoother and more stable operation."
            ]
        },
        {
            "id": 2,
            "version": "v0.4.40",
            "date": "August 17, 2025",
            "type": "beta",
            "summary": "An update aimed at improving project presentation and overall website quality. The release makes project information more visual and the interface more stable.",
            "changes": [
                "A metadata card styled as a project code editor has been added to the “About Me” page, visually showcasing key metrics and the project structure.",
                "Website performance has been optimized and minor bugs have been fixed, improving stability and smooth interaction with the interface."
            ]
        },
        {
            "id": 3,
            "version": "v0.5.83",
            "date": "August 29, 2025",
            "type": "beta",
            "summary": "An update focused on improving interaction with the gallery. The release lays the groundwork for a more interactive and informative content viewing experience.",
            "changes": [
                "Interactive photos have been added to the “Gallery” page, allowing users to view brief information on the back side of an image when clicked."
            ]
        },
        {
            "id": 4,
            "version": "v0.5.153",
            "date": "September 10, 2025",
            "type": "minor",
            "summary": "An update aimed at more fully showcasing the professional profile and improving overall website quality. The release makes the homepage more informative and easier to understand.",
            "changes": [
                "New sections “My Development Approach” and “Tech Stack” have been added to the homepage, helping better convey working principles and professional focus.",
                "Website performance has been optimized and minor bugs have been fixed, improving stability and smooth interaction with the interface."
            ]
        },
        {
            "id": 5,
            "version": "v0.6.42",
            "date": "September 16, 2025",
            "type": "minor",
            "summary": "An update focused on personalizing the “About Me” page and improving overall website quality. The release makes the content feel more alive and improves interface stability.",
            "changes": [
                "A music player card has been added to the “About Me” page, allowing visitors to listen to a selection of favorite tracks.",
                "Website performance has been optimized and minor bugs have been fixed, improving stability and smooth interaction with the interface."
            ]
        },
        {
            "id": 6,
            "version": "v0.7.92",
            "date": "September 22, 2025",
            "type": "beta",
            "summary": "An update focused on visual redesign and experimental interaction elements. The release explores new approaches to content presentation and interactivity on the “About Me” page.",
            "changes": [
                "The design of cards on the “About Me” page has been redesigned, improving visual consistency and content readability.",
                "An interactive card with the website UI kit has been added, allowing users to visually explore interface elements and their behavior.",
                "An interactive card with draggable icons has been added, enhancing the sense of live interaction with the interface."
            ]
        },
        {
            "id": 7,
            "version": "v0.8.42",
            "date": "September 24, 2025",
            "type": "improvement",
            "summary": "An update aimed at improving usability and overall responsiveness of the website. The release makes interaction with the interface more comfortable and stable.",
            "changes": [
                "Usability and visual appearance of the website have been improved, making navigation clearer and cleaner.",
                "Page performance has been optimized, increasing speed and interface responsiveness."
            ]
        },
        {
            "id": 8,
            "version": "v0.9.59",
            "date": "September 28, 2025",
            "type": "minor",
            "summary": "An update focused on clarifying and structuring project information. The release makes the “About the Project” page clearer and more context-oriented.",
            "changes": [
                "The sections “Areas of Responsibility” and “Context and Goal” have been added to the “About the Project” page, increasing clarity and helping better understand the project and role within it."
            ]
        },
        {
            "id": 9,
            "version": "v1.0.0",
            "date": "October 7, 2025",
            "type": "major",
            "summary": "The first official release 🎉, marking the first stable version of the project and laying the foundation for future development. The update improves website reliability and content accessibility across devices.",
            "changes": [
                "Comprehensive optimization has been carried out and minor bugs have been fixed, improving website speed and stability.",
                "Responsive interface support for tablets and mobile devices has been added, improving content viewing across different screen sizes.",
                "A new project, “Password Generator”, has been added to the projects page, expanding the portfolio.",
                "The music player content has been updated with new tracks."
            ]
        },
        {
            "id": 10,
            "version": "v1.1.36",
            "date": "December 17, 2025",
            "type": "improvement",
            "summary": "A minor update focused on improving visual consistency of the interface and strengthening the project foundation. The release makes the website cleaner, clearer, and more stable for everyday use.",
            "changes": [
                "The interface has been updated across the entire project, improving visual consistency and overall polish.",
                "The card design in the “My Development Approach” and “Tech Stack” sections has been redesigned, improving readability, structure, and visual hierarchy.",
                "Internal application logic has been optimized, increasing stability and simplifying future development."
            ]
        },
        {
            "id": 11,
            "version": "v1.2.61",
            "date": "January 8, 2026",
            "type": "major",
            "summary": "An update focused on perception quality and operational stability of the website. The release improves interface predictability and makes project presentation more expressive and clear.",
            "changes": [
                "Internal website logic has been optimized, improving performance, stability, and interface predictability across different usage scenarios.",
                "Texts across the entire website have been updated and refined, making wording more precise, structured, and reflective of the projects and development approach.",
                "Video covers have been added to project cards, enhancing visual clarity and helping users quickly understand the idea and functionality of each project."
            ]
        },
        {
            "id": 12,
            "version": "v1.3.84",
            "date": "February 15, 2026",
            "type": "improvement",
            "summary": "An update aimed at fundamentally improving code quality, performance, and visual perception of the project. The release makes the website lighter, more stable, and more systematic both in terms of interface and internal structure.",
            "changes": [
                "The architectural foundation of the project has been reworked, improving interface behavior predictability and simplifying future development.",
                "Internal logic has been optimized and code size reduced, decreasing browser load and speeding up website performance.",
                "Application state management has been optimized, improving performance and stability in everyday usage scenarios.",
                "The visual concept of the interface has been updated, making the design lighter, more minimalistic, and modern.",
                "The changelog has been reworked, improving structure, readability, and navigation by update types.",
                "Minor visual and functional bugs have been fixed, improving overall quality and polish of the interface."
            ]
        }
    ]
}
